{
  "scraped_at": "2025-07-18T05:34:59.997291",
  "event_name": "OpenSauce 2025",
  "event_url": "https://opensauce.com/agenda/",
  "event_dates": "July 18-20, 2025",
  "location": "San Francisco, CA",
  "days": {
    "saturday": {
      "day_name": "Saturday",
      "date": "July 19, 2025",
      "sessions": [
        {
          "time": "10:30 AM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "SAFETY THIRD: LIVE! Safety Third but it's LIVE! The hosts (and some guests) share stories and rant while pretending to talk about science.",
          "speakers": []
        },
        {
          "time": "11:00 AM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "OUTDOOR STAGE INNOVATING IN A NICHE Some people chase trends, but these creators have built strong, loyal audiences by sticking to what they love and finding others who love it too. Hear how to turn niche ideas into standout content.",
          "speakers": []
        },
        {
          "time": "11:15 AM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "PROTOTYPING TO PRODUCT Making one cool thing for a YouTube video is tough enough, but turning that idea into 10,000 units is a whole different challenge. Learn how these creators have taken their custom-built projects from prototype to product. The Hacksmith",
          "speakers": []
        },
        {
          "time": "12:00 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "THE BACKYARD - AGAINS We’re back! Join as the cast of The Yard returns for more Backyard Science in the squeak-uel we've all been waiting for.",
          "speakers": []
        },
        {
          "time": "12:45 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "SECOND STAGE TEAM ROCKET Join us to nerd out over thrust vectors, propellants, shock diamonds, and more rocket words! It's gonna rock(et).",
          "speakers": []
        },
        {
          "time": "01:30 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "SECOND STAGE COULD AI MAKE THIS PANEL? It - made - this - description!",
          "speakers": []
        },
        {
          "time": "01:30 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "IT'S ALL ABOUT CHEMISTRY We all know \"Chemistry is the scientific study of matter, its properties, and how it changes during chemical reactions. It explores the building blocks of the universe such as atoms and molecules and how they interact to form everything from water to DNA. Chemistry connects the physical world with biological and environmental systems\", and this panel connects you with your favorite chemistry creators. Will they bond?",
          "speakers": []
        },
        {
          "time": "01:45 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "OUTDOOR STAGE PLANES, TRAINS, AND AUTOMOBILES Walking is overrated. This gang of creators prefers to drive, fly and float their way around.",
          "speakers": [
            "Peter Sripol"
          ]
        },
        {
          "time": "02:00 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "STREAMING AMA It doesn't get more live than this. Chat with top streaming creators in this Q&A panel. Questions for the panel must be submitted in advance via the event app. Bao The Whale",
          "speakers": []
        },
        {
          "time": "02:15 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "OUTDOOR STAGE UNCONVENTIONAL MATERIALS Wood, metal, and plastic are fine...but why stop there? How to make something from anything.",
          "speakers": [
            "Peter Brown"
          ]
        },
        {
          "time": "02:30 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "STATE OF THE UNION Over the past two decades, content creation has evolved from webcam vlogs into a multi-billion-dollar industry. Join us as we chat about the shifts in platforms, audiences, algorithms, and where we might be headed next.",
          "speakers": []
        },
        {
          "time": "03:00 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "SUPER VILLAIN INC. Trapped in an entry level job, creators are forced to innovate at the will of an evil corporate overlord. Watch as they navigate a game of ethics, corporate bureaucracy, and the laws of physics. Will there be synergy? Colin Furze",
          "speakers": []
        },
        {
          "time": "04:00 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "SECOND STAGE GNIREENIGNE: REVERSE ENGINEERING .gnireenigne s'taht won ,rehtegot kcab meht gnittup ,trapA sgniht gnikaT",
          "speakers": [
            "Strange Parts"
          ]
        },
        {
          "time": "04:00 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "Open Sauce exhibitors team up with creators to pitch their projects to a panel of vicious business carp. Will the ideas (and their inventors) sink or swim under the pressure? William Osman",
          "speakers": []
        },
        {
          "time": "04:30 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "SECOND STAGE ROBOTICS AND ANIMATRONICS! What if the robots could move?",
          "speakers": []
        },
        {
          "time": "05:00 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "SECOND STAGE 3D PRINTING HOT TAKES From failed first layers, to funky filaments, and a billion “Benchy’s”: these creators' and their 3D printing opinions are like onions (they have layers). Join them for a layered discussion about printers, slicers, and so many layers.",
          "speakers": [
            "CNC Kitchen"
          ]
        },
        {
          "time": "05:00 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "ARE YOU DUMBER THAN A SIXTH GRADER? Four creators vs four sixth graders. Who will win?",
          "speakers": []
        },
        {
          "time": "05:30 PM",
          "duration": "",
          "venue": "",
          "title": "",
          "description": "SECOND STAGE DOING IT THE HARD WAY (YE' OLDE MAKERS) Ignoring the advances of technology over the past few decades is… a choice.",
          "speakers": []
        }
      ]
    }
  }
}